# FROM — задаёт базовый (родительский) образ
FROM postgres:latest

# RUN - выполняет команду и создаёт слой образа. Используется для установки в контейнер пакетов
# WORKDIR — задаёт рабочую директорию для следующей инструкции
RUN mkdir -p /docker_app/simple_cod
# (-p тут означает, что мы создаем все папки из заданного пути)
WORKDIR /docker_app/simple_cod

# копирует в контейнер файлы и папки (в данном случае точка означает, что из нашей активной директории)
COPY . /docker_app/simple_cod

#EXPOSE 8080

ENV TZ Europe/Moscow

#RUN pip install --no-cache-dir -r requirements.txt

# описывает команду с аргументами, которую нужно выполнить когда контейнер будет запущен.
# Аргументы могут быть переопределены при запуске контейнера. В файле может присутствовать лишь одна инструкция CMD
CMD ["python", "example1.py"]